{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [21, 2], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [2], "name": "dense_3/bias"}]}], "modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 0.009999999776482582, "momentum": 0.0, "decay": 0.0}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.2.5", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "batch_input_shape": [null, 21], "use_bias": true, "activity_regularizer": null}}], "name": "sequential_3"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.6.0", "format": "layers-model"}